# ; БОДЛОГУУД:
# ; 1. Гурвалжны 3 тал өгөгдсөн бол (гурвалжны тал болох эсэх нөхцлийг шалгаж) гурвалжны талбай ба периметрийг олох программ зохио.
# ; 2. 100-аас бага тэгш тоонуудыг do оператор ашиглан хэвлэх программ зохио.
# ; 3. Дурын n тоон цувааны үржвэрийг while оператор ашиглан хэвлэх программ
# ; зохио.
# ; 4. For давталт ашиглан 1-ээс n хүртэлх тоог 3 алхамтайгаар өсөхөөр хэвлэх
# ; программ зохио.
# ; 5. For давталт ашиглан 1-ээс 10 хүртэлх тоонуудын нийлбэрийг хэвлэх
# ; программ зохио.
# ; 6. Өгсөн а тооны n хүртэлх зэргүүдийг хэвлэх программ зохио.
# ; 7. 100-аас бага 3 –д хуваагдах тоонуудыг буурахаар хэвлэх программ зохио.
# ; 8. Дурын тэмдэгт мөр хувьсагчийг (жнь: hello) n удаа дараалан болон шинэ
# ; мөрөнд хэвлэх программ зохио.
# ; 9. 1-ээс n хүртэлх сондгой тоонуудын нийлбэрийг олох программ зохио.
# ; 10. Өгсөн m тооны квадрат болон куб зэргүүдийг хэвлэх программ зохио.
# ; 11. 2-оос 100 хүртэлх бүх тэгш тоог for ашиглан хэвлэх программ зохио.
# ; 12. Өгсөн m тооны хүрдийг хэвлэх программ зохио.
# ; 13. 1-ээс 100 хүртэлх бүх сондгой тоог while ашиглан хэвлэх программ зохио.
# ; 14. Өгсөн n бүхэл тооны факториалыг олох программ зохио.
# ; 15. Өгсөн n тоо хүртэлх сондгой тоонуудын факториалуудын нийлбэрийг олох
# ; программ зохио.
# ; 16. [50, 100] завсарт орших 7-д хуваагддаг тоонуудын цифрүүдийн нийлбэрийг
# ; олох программ зохио.
# ; 17. Тоог урдаас нь хойш, хойноос урагш бичихэд тэнцүү байх тоог хөрвөсөн тоо
# ; буюу “палиндром тоо” гэдэг. [100, 150] завсарт байх палиндром тоонуудыг
# ; хэвлэх программ зохио.
# ; 18. [100, 200] завсарт орших тоонуудаас 25-д хуваагдах тоонуудын хөрвөсөн
# ; тоог хэвлэх программ зохио.
# ; 19. N бүхэл тоо өгөгджээ. 1-ээс N хүртэлх тэгш тоонуудыг өөрөөс нь 2 дахин бага
# ; тоон зэрэгт дэвшүүлж гарсан утгуудын нийлбэрийг олох программ зохио.
# ; 20. 1100110 ба 10101 тоонууд хооронд логик and, or, xor үйлдлүүд хийж зөв хариуг 10 ба 2-тын тоогоор харуул;
# ; 21. 16 суурьтай системд өгсөн тоог 10 суурьтай тооллын системд хөрвүүлэх. 22. N бүхэл тоо өгөгджээ. 1-ээс N хүртэлх бүх сондгой тоогоос квадрат язгуурыг
# ; бодож, гарсан утгуудын нийлбэрийг олох программ зохио.
# ; 23. 1100110 ба 10101 тоонууд хооронд нэмэх, хасах, үржих үйлдлүүд хийж зөв
# ; хариуг 10 ба 2-тын тоогоор харуул.
# ; 24. Өгсөн а тоог анхны тоо эсэхийг шалгах программ зохио.
# ; 25. [a, b] завсар дахь хөрвөсөн тооноосоо их байх тоонуудыг хэвлэ.
# ; 26. Өгсөн n хүртэлх тоонуудын факториалуудын нийлбэрийг олох программ
# ; зохио.
# ; 27. Өөрийнхөө цифрүүдийн нийлбэрт хуваагддаг 3 оронтой тоог “сайн тоо”
# ; гэдэг. Бүх сайн тоог хэвлэ. Мөн хэд байгааг тоолох программ зохио.
# ; 28. Фибоначчийн эхний к ширхэг гишүүнийг хэвлэ (Фибоначчийн тоо нь дараах дарааллаас бүрдэнэ: 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, .... Тодорхойлолт ёсоор бол Фибоначчийн тооны эхний 2 тоо нь 0 болон 1 гэж өгөгдсөн ба түүнээс хойшхи Фибоначчийн тоонууд нь өмнөх 2 тооныхоо нийлбэртэй
# ; тэнцүү болно).
# ; 29. 2 суурьтай системд өгсөн тоог 10 суурьтай тооллын системд хөрвүүл.
# ; 30. 4 оронтой бүх палиндром тоог хэвлэж, нийт хэдэн тоо байгааг тоол.


#Бодлого 1 

# ; 1. Гурвалжны 3 тал өгөгдсөн бол (гурвалжны тал болох эсэх нөхцлийг шалгаж) гурвалжны талбай ба периметрийг олох программ зохио.
def triangle(): 
    a = int(input('Enter a= '))
    b = int(input('Enter b= '))
    c = int(input('Enter c= '))
print( a + b + c )

triangle()