# МЭДЛЭГ ШАЛГАХ АСУУЛТ
# 1. Дараахаас аль нь “Бат”-ын нэрийн бит хэмжээ вэ? 
# a. 3 b. 8 c. 24 d. 32

# 2. Дараахаас аль илэрхийлэл нь үнэн вэ?
 # a. KB<MB<GB<TB<PB<EB<ZB<YB b. KB<MB<GB<TB<PB<EB<YB<ZB c. KB<MB<TB<GB<PB<EB<ZB<YB

# 3. 16Gb флаш диск хэдэн Mb хэмжээтэй тэнцэх вэ? 
# a. 1024Mb b. 8192Mb c. 16384Mb

# Лабораторийн ажил No1

# 4. Тоог дүрсэлж бичих бөгөөд тоон дээр үйлдэл хийх дүрмүүдийн системийг _____________________ систем гэдэг.
# a. тоон b. тооллын c. мэдээллийн

# 5. 1 мега байт нь ... тэнцүү.
# a. 10242 буюу 220 байттай b. 1000 буюу 103 байттай c. 1000000 буюу 106 байттай d. 10241 буюу 210 байттай