#ЛАБОРАТОРИЙН АЖИЛ No6.

# Дасгал 6.1. for давталт ашиглан 0-ээс 5 хүртэлх тоог хэвлэ.

for i in range(5):
print(i)

# Дасгал 6.2. for давталт ашиглан 1-ээс 10 хүртэлх сондгой тоонуудыг хэвлэ.

for i in range(1, 11):
       if i % 2 != 0:
print(i)

# Дасгал 6.3. for давталт ашиглан 0-ээс 100 хүртэлх тэгш тоонуудыг 15 алхамаар хэвлэ.
for i in range(0, 100, 15):
       if i % 2 == 0:
print(i)

# Дасгал 6.4. while давталт ашиглан 0-ээс 10 хүртэлх сондгой тоонуудыг хэвлэ.


x=1
while x < 11:
       if x % 2 !=0:
             print(x)     x += 1

# Дасгал 6.5. break оператор ашиглан bat@must.edu.mn и-мэйл хаягаас @ тэмдэгт хүртэлх тэмдэгтийг хэвлэ.


for ch in "bat@must.edu.mn":
       if ch == "@":
             break     print(ch)

# Дасгал 6.6. continue оператор ашиглан тоон дарааллаас 0-ийг x тэмдэгтээр сольж хэвлэ.

for digit in "0165031806510":
       if digit == "0":
             print("x", end="")
             continue     print(digit,
       end="")

# Дасгал 6.7. for ... else оператор ашиглан 0-ээс 3 хүртэлх тоонуудыг хэвлэ.

for i in range(0, 3):
       print(i)
else:
       print(i, "ended")

# Дасгал 6.8. while ... else оператор ашиглан 5-аас 0 хүртэлх тоонуудыг буурахаар хэвлэ.

n=4
while n > 0:
print(n + 1)
n -= 1 else:
print(n)

# БИЕ ДААЖ БОДОХ БОДЛОГУУД:
# Бодлого 6-1: Бодлого 6-2: Бодлого 6-3: Бодлого 6-4: Бодлого 6-5: Бодлого 6-6:
# Өгсөн а тоог анхны тоо эсэхийг шалга.
num = 0
for i in range(100):
       if num //2:
       print(i)
       i += 1
# Өгсөн n тоо хичнээн оронтойг тоол.

# Эхний ба сүүлийн цифр ижил байх 50-иас бага бүх тоог хэвлэ.

# 2 суурьтай системд өгсөн тоог 10 суурьтай тооллын системд хөрвүүл. 8 суурьтай системд өгсөн тоог 10 суурьтай тооллын системд хөрвүүл. Фибоначчийн к-д хуваагдах хамгийн бага гишүүнийг ол.









